emacs/configs/12-platform-macos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>macOS-Specific Configuration</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/style.css"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="content">
<h1 class="title">macOS-Specific Configuration</h1>
<p>
Settings that only apply on macOS systems.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">macos-conf.el --- Summary  -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">m180/font-set</span> ()
  <span class="org-doc">"Font settings for MacOS."</span>
  (set-face-attribute 'fixed-pitch nil <span class="org-builtin">:family</span> <span class="org-string">"Iosevka Nerd Font Mono"</span> <span class="org-builtin">:height</span> 160 <span class="org-builtin">:weight</span> 'extra-light)
  (set-face-attribute 'default nil <span class="org-builtin">:family</span> <span class="org-string">"Iosevka Nerd Font Mono"</span> <span class="org-builtin">:height</span> 160 <span class="org-builtin">:weight</span> 'extra-light)
  (set-fontset-font t 'hangul (font-spec <span class="org-builtin">:name</span> <span class="org-string">"NotoSansKR"</span>)))

(<span class="org-keyword">if</span> (daemonp)
      (add-hook 'server-after-make-frame-hook #'m180/font-set)
  (m180/font-set))

(<span class="org-keyword">setq</span> insert-directory-program <span class="org-string">"gls"</span>)
(<span class="org-keyword">setq</span> mac-command-modifier 'meta)

(<span class="org-keyword">when</span> (executable-find <span class="org-string">"zsh"</span>)
  (setenv <span class="org-string">"SHELL"</span> (executable-find <span class="org-string">"zsh"</span>)))

(<span class="org-keyword">provide</span> '<span class="org-constant">macos-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">macos-conf.el ends here</span>
</pre>
</div>
</main>
</body>
</html>
